Процедура ДобавлениеРеквизитаНаФорму(Форма) Экспорт
	//++ Жоголев Д  Задача: Добавление реквизита на форму 27.02.25     
	Если Форма.Элементы.Найти("ДЗ_КонтактноеЛицо") = Неопределено Тогда 
		Если НЕ Форма.Элементы.Найти("ГруппаШапкаПраво") = Неопределено Тогда		
			ПолеВвода = Форма.Элементы.Добавить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);    
		ИначеЕсли НЕ Форма.Элементы.Найти("Основание") = Неопределено Тогда                                         
			ПолеВвода = Форма.Элементы.Вставить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.Основание);
		ИначеЕсли НЕ Форма.Элементы.Найти("СуммаДокумента") = Неопределено Тогда                                         
			ПолеВвода = Форма.Элементы.Вставить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
		Иначе
			ПолеВвода = Форма.Элементы.Добавить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"),Неопределено);
		КонецЕсли;	
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.Заголовок = "Контактное лицо";
		ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	КонецЕсли;	
	//-- Жоголев Д  Задача: Добавление реквизита на форму 27.02.25
КонецПроцедуры