
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	//++ Жоголев Д  Задача: Добавление реквизита на форму 27.02.25                     
	
	Группа = Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"),Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;       
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
	Группа.ОтображатьЗаголовок = Ложь;
	
	Если Элементы.Найти("ДЗ_СогласованнаяСкидка") = Неопределено Тогда               
		ПолеВвода = Элементы.Добавить("ДЗ_СогласованнаяСкидка", Тип("ПолеФормы"),Элементы.ГруппаСкидка);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.Заголовок = "Согласованная скидка";
		ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
		ПолеВвода.УстановитьДействие("ПриИзменении", "ДЗК_ДЗК_СогласованнаяСкидкаПриИзменении");
	КонецЕсли;	 		           
	
	Команда = Команды.Добавить("ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Действие = "ДЗК_ПересчитатьТаблицу";       
	
	КнопкаФормы = Элементы.Добавить("КнопкаКомандыПересчитатьТаблицу", Тип("КнопкаФормы"), Элементы.ГруппаСкидка);
	КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	//-- Жоголев Д  Задача: Добавление реквизита на форму 27.02.25

	
КонецПроцедуры

&НаКлиенте
Процедура ДЗК_ПересчитатьТаблицу(Команда)    
	//++ Жоголев Д  Задача: Добавление реквизита на форму 27.02.25	
	ПересчитатьСтрокиДокументаНаКлиенте();   	
	//-- Жоголев Д  Задача: Добавление реквизита на форму 27.02.25		
КонецПроцедуры

&НаКлиенте
Процедура ДЗК_ДЗК_СогласованнаяСкидкаПриИзменении(Элемент) 
	//++ Жоголев Д  Задача: Добавление реквизита на форму 27.02.25	
	КС = КоличествоСтрокТоваровУслуг();
	Если КС = 0 Тогда
		Возврат;
	КонецЕсли;	       
	ЗадатьВопросПользователюАсинх();   
	//-- Жоголев Д  Задача: Добавление реквизита на форму 27.02.25	
КонецПроцедуры 

&НаКлиенте
Асинх Процедура ЗадатьВопросПользователюАсинх()  
	//++ Жоголев Д  Задача: Добавление реквизита на форму 27.02.25		
	Обещание = ВопросАсинх("Пересчитать строки со скидкой?", РежимДиалогаВопрос.ДаНет);
	ОтветНаВопрос = Ждать Обещание;
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ПересчитатьСтрокиДокументаНаКлиенте();
	Иначе
		Возврат;
	КонецЕсли;	
	//-- Жоголев Д  Задача: Добавление реквизита на форму 27.02.25	
КонецПроцедуры	  

&НаКлиенте
Процедура ПересчитатьСтрокиДокументаНаКлиенте()
	//++ Жоголев Д  Задача: Добавление реквизита на форму 27.02.25	
	Для Каждого Стр из Объект.Товары Цикл  
		РассчитатьСуммуСтроки(Стр);	
		РассчитатьСуммуДокумента();
	КонецЦикла;	   
	Для Каждого Стр из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(Стр);
		РассчитатьСуммуДокумента();
	КонецЦикла;	 
	//-- Жоголев Д  Задача: Добавление реквизита на форму 27.02.25				
КонецПроцедуры	

Функция КоличествоСтрокТоваровУслуг()   
	//++ Жоголев Д  Задача: Добавление реквизита на форму 27.02.25		
	КС = Объект.Товары.Количество() + Объект.Услуги.Количество(); 
	Возврат КС;   
	//-- Жоголев Д  Задача: Добавление реквизита на форму 27.02.25		
КонецФункции  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//++ Жоголев Д Задача: Расчет документа со скидкой 30.12.24 	
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	КоэффициентСкидки = 1 - (ТекущиеДанные.Скидка / 100 + Объект.ДЗ_СогласованнаяСкидка/100);
	Если КоэффициентСкидки > 0 Тогда 		
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	Иначе
		ТекущиеДанные.Сумма = 0;
		Сообщить("Не корректная суммарная скидка > 100%");
	КонецЕсли;
	//-- Жоголев Д Задача: Расчет документа со скидкой 30.12.24

	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
